bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G0B0.svd
        <register>
          <name>DMAMUX_C5CR</name>
          <displayName>DMAMUX_C5CR</displayName>
          <description>DMAMUX request line multiplexer channel x configuration register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
			  <field>
				<name>DMAREQ_ID</name>
				<description>DMA request identification
	Selects the input DMA request. See the DMAMUX table about assignments of multiplexer inputs to resources.</description>
				<bitOffset>0</bitOffset>
				<bitWidth>6</bitWidth>
				<access>read-write</access>
			  </field>
			  <field>
				<name>SOIE</name>
				<description>Synchronization overrun interrupt enable</description>
				<bitOffset>8</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>interrupt disabled</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>interrupt enabled</description>
					<value>0x1</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>EGE</name>
				<description>Event generation enable</description>
				<bitOffset>9</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>event generation disabled</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>event generation enabled</description>
					<value>0x1</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>SE</name>
				<description>Synchronization enable</description>
				<bitOffset>16</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>synchronization disabled</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>synchronization enabled</description>
					<value>0x1</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>SPOL</name>
				<description>Synchronization polarity
	Defines the edge polarity of the selected synchronization input:</description>
				<bitOffset>17</bitOffset>
				<bitWidth>2</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>no event, i.e. no synchronization nor detection.</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>rising edge</description>
					<value>0x1</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x2</name>
					<description>falling edge</description>
					<value>0x2</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x3</name>
					<description>rising and falling edge</description>
					<value>0x3</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>NBREQ</name>
				<description>Number of DMA requests minus 1 to forward
	Defines the number of DMA requests to forward to the DMA controller after a synchronization event, and/or the number of DMA requests before an output event is generated.
	This field shall only be written when both SE and EGE bits are low.</description>
				<bitOffset>19</bitOffset>
				<bitWidth>5</bitWidth>
				<access>read-write</access>
			  </field>
			  <field>
				<name>SYNC_ID</name>
				<description>Synchronization identification
	Selects the synchronization input (see inputs to resources STM32G0).</description>
				<bitOffset>24</bitOffset>
				<bitWidth>5</bitWidth>
				<access>read-write</access>
			  </field>
          </fields>
        </register>
        <register>
          <name>DMAMUX_C6CR</name>
          <displayName>DMAMUX_C6CR</displayName>
          <description>DMAMUX request line multiplexer channel x configuration register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
			  <field>
				<name>DMAREQ_ID</name>
				<description>DMA request identification
	Selects the input DMA request. See the DMAMUX table about assignments of multiplexer inputs to resources.</description>
				<bitOffset>0</bitOffset>
				<bitWidth>6</bitWidth>
				<access>read-write</access>
			  </field>
			  <field>
				<name>SOIE</name>
				<description>Synchronization overrun interrupt enable</description>
				<bitOffset>8</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>interrupt disabled</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>interrupt enabled</description>
					<value>0x1</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>EGE</name>
				<description>Event generation enable</description>
				<bitOffset>9</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>event generation disabled</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>event generation enabled</description>
					<value>0x1</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>SE</name>
				<description>Synchronization enable</description>
				<bitOffset>16</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>synchronization disabled</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>synchronization enabled</description>
					<value>0x1</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>SPOL</name>
				<description>Synchronization polarity
	Defines the edge polarity of the selected synchronization input:</description>
				<bitOffset>17</bitOffset>
				<bitWidth>2</bitWidth>
				<access>read-write</access>
				<enumeratedValues>
				  <enumeratedValue>
					<name>B_0x0</name>
					<description>no event, i.e. no synchronization nor detection.</description>
					<value>0x0</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x1</name>
					<description>rising edge</description>
					<value>0x1</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x2</name>
					<description>falling edge</description>
					<value>0x2</value>
				  </enumeratedValue>
				  <enumeratedValue>
					<name>B_0x3</name>
					<description>rising and falling edge</description>
					<value>0x3</value>
				  </enumeratedValue>
				</enumeratedValues>
			  </field>
			  <field>
				<name>NBREQ</name>
				<description>Number of DMA requests minus 1 to forward
	Defines the number of DMA requests to forward to the DMA controller after a synchronization event, and/or the number of DMA requests before an output event is generated.
	This field shall only be written when both SE and EGE bits are low.</description>
				<bitOffset>19</bitOffset>
				<bitWidth>5</bitWidth>
				<access>read-write</access>
			  </field>
			  <field>
				<name>SYNC_ID</name>
				<description>Synchronization identification
	Selects the synchronization input (see inputs to resources STM32G0).</description>
				<bitOffset>24</bitOffset>
				<bitWidth>5</bitWidth>
				<access>read-write</access>
			  </field>
          </fields>
        </register>
		<register>
          <name>DMAMUX_CSR</name>
		  <displayName>DMAMUX_CSR</displayName>
          <description>DMAMUX request line multiplexer interrupt channel status register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
		  <fields>
			  <field>
				<name>SOF0</name>
				<description>Synchronization overrun event flag
	The flag is set when a synchronization event occurs on a DMA request line multiplexer channel x, while the DMA request counter value is lower than NBREQ.
	The flag is cleared by writing 1 to the corresponding CSOFx bit in DMAMUX_CFR register.</description>
				<bitOffset>0</bitOffset>				
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>SOF1</name>
				<description>Synchronization overrun event flag
	The flag is set when a synchronization event occurs on a DMA request line multiplexer channel x, while the DMA request counter value is lower than NBREQ.
	The flag is cleared by writing 1 to the corresponding CSOFx bit in DMAMUX_CFR register.</description>
				<bitOffset>1</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>SOF2</name>
				<description>Synchronization overrun event flag
	The flag is set when a synchronization event occurs on a DMA request line multiplexer channel x, while the DMA request counter value is lower than NBREQ.
	The flag is cleared by writing 1 to the corresponding CSOFx bit in DMAMUX_CFR register.</description>
				<bitOffset>2</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>SOF3</name>
				<description>Synchronization overrun event flag
	The flag is set when a synchronization event occurs on a DMA request line multiplexer channel x, while the DMA request counter value is lower than NBREQ.
	The flag is cleared by writing 1 to the corresponding CSOFx bit in DMAMUX_CFR register.</description>
				<bitOffset>3</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>SOF4</name>
				<description>Synchronization overrun event flag
	The flag is set when a synchronization event occurs on a DMA request line multiplexer channel x, while the DMA request counter value is lower than NBREQ.
	The flag is cleared by writing 1 to the corresponding CSOFx bit in DMAMUX_CFR register.</description>
				<bitOffset>4</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>SOF5</name>
				<description>Synchronization overrun event flag
	The flag is set when a synchronization event occurs on a DMA request line multiplexer channel x, while the DMA request counter value is lower than NBREQ.
	The flag is cleared by writing 1 to the corresponding CSOFx bit in DMAMUX_CFR register.</description>
				<bitOffset>5</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
			  <field>
				<name>SOF6</name>
				<description>Synchronization overrun event flag
	The flag is set when a synchronization event occurs on a DMA request line multiplexer channel x, while the DMA request counter value is lower than NBREQ.
	The flag is cleared by writing 1 to the corresponding CSOFx bit in DMAMUX_CFR register.</description>
				<bitOffset>6</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
			  </field>
		  </fields>
        </register>
		<register>
          <name>DMAMUX_CFR</name>
          <displayName>DMAMUX_CFR</displayName>
		  <description>DMAMUX request line multiplexer interrupt clear flag register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
		  <fields>
          <field>
            <name>CSOF0</name>
            <description>Clear synchronization overrun event flag
Writing 1 in each bit clears the corresponding overrun flag SOFx in the DMAMUX_CSR register.</description>
            <bitOffset>0</bitOffset>
           
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>CSOF1</name>
            <description>Clear synchronization overrun event flag
Writing 1 in each bit clears the corresponding overrun flag SOFx in the DMAMUX_CSR register.</description>
            <bitOffset>1</bitOffset>
           
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>CSOF2</name>
            <description>Clear synchronization overrun event flag
Writing 1 in each bit clears the corresponding overrun flag SOFx in the DMAMUX_CSR register.</description>
            <bitOffset>2</bitOffset>
           
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>CSOF3</name>
            <description>Clear synchronization overrun event flag
Writing 1 in each bit clears the corresponding overrun flag SOFx in the DMAMUX_CSR register.</description>
            <bitOffset>3</bitOffset>
           
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>CSOF4</name>
            <description>Clear synchronization overrun event flag
Writing 1 in each bit clears the corresponding overrun flag SOFx in the DMAMUX_CSR register.</description>
            <bitOffset>4</bitOffset>
           
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>CSOF5</name>
            <description>Clear synchronization overrun event flag
Writing 1 in each bit clears the corresponding overrun flag SOFx in the DMAMUX_CSR register.</description>
            <bitOffset>5</bitOffset>
           
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>CSOF6</name>
            <description>Clear synchronization overrun event flag
Writing 1 in each bit clears the corresponding overrun flag SOFx in the DMAMUX_CSR register.</description>
            <bitOffset>6</bitOffset>
           
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
		  </fields>
        </register>		
        <register>
          <name>DMAMUX_RG0CR</name>
          <displayName>DMAMUX_RG0CR</displayName>
          <description>DMAMUX request generator channel x configuration register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
          <field>
            <name>SIG_ID</name>
            <description>Signal identification
Selects the DMA request trigger input used for the channel x of the DMA request generator</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OIE</name>
            <description>Trigger overrun interrupt enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>interrupt on a trigger overrun event occurrence is disabled</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>interrupt on a trigger overrun event occurrence is enabled</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>GE</name>
            <description>DMA request generator channel x enable</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>DMA request generator channel x disabled</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>DMA request generator channel x enabled</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>GPOL</name>
            <description>DMA request generator trigger polarity
Defines the edge polarity of the selected trigger input</description>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>no event. I.e. none trigger detection nor generation.</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>rising edge</description>
                <value>0x1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x2</name>
                <description>falling edge</description>
                <value>0x2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x3</name>
                <description>rising and falling edge</description>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>GNBREQ</name>
            <description>Number of DMA requests to be generated (minus 1)
Defines the number of DMA requests to be generated after a trigger event. The actual number of generated DMA requests is GNBREQ +1.
Note: This field shall only be written when GE bit is disabled.</description>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
        </register>
        <register>
          <name>DMAMUX_RG1CR</name>
          <displayName>DMAMUX_RG1CR</displayName>
          <description>DMAMUX request generator channel x configuration register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
          <field>
            <name>SIG_ID</name>
            <description>Signal identification
Selects the DMA request trigger input used for the channel x of the DMA request generator</description>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          <field>
            <name>OIE</name>
            <description>Trigger overrun interrupt enable</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>interrupt on a trigger overrun event occurrence is disabled</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>interrupt on a trigger overrun event occurrence is enabled</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>GE</name>
            <description>DMA request generator channel x enable</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>DMA request generator channel x disabled</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>DMA request generator channel x enabled</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>GPOL</name>
            <description>DMA request generator trigger polarity
Defines the edge polarity of the selected trigger input</description>
            <bitOffset>17</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>no event. I.e. none trigger detection nor generation.</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>rising edge</description>
                <value>0x1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x2</name>
                <description>falling edge</description>
                <value>0x2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x3</name>
                <description>rising and falling edge</description>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>GNBREQ</name>
            <description>Number of DMA requests to be generated (minus 1)
Defines the number of DMA requests to be generated after a trigger event. The actual number of generated DMA requests is GNBREQ +1.
Note: This field shall only be written when GE bit is disabled.</description>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
        </register>
