bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G0B0.svd
          </field>
          <field>
            <name>CC1OF</name>
            <description>Capture/Compare 1 overcapture flag
This flag is set by hardware only when the corresponding channel is configured in input capture mode. It is cleared by software by writing it to '0â.</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>No overcapture has been detected.</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>The counter value has been captured in TIMx_CCR1 register while CC1IF flag was already set</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            
          </field>
          <field>
            <name>CC2OF</name>
            <description>Capture/Compare 2 overcapture flag
Refer to CC1OF description</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            
          </field>
          <field>
            <name>CC3OF</name>
            <description>Capture/Compare 3 overcapture flag
Refer to CC1OF description</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            
          </field>
          <field>
            <name>CC4OF</name>
            <description>Capture/Compare 4 overcapture flag
Refer to CC1OF description</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            
          </field>
          <field>
            <name>SBIF</name>
            <description>System Break interrupt flag
This flag is set by hardware as soon as the system break input goes active. It can be cleared by software if the system break input is not active.
This flag must be reset to re-start PWM operation.</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>No break event occurred.</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>An active level has been detected on the system break input. An interrupt is generated if BIE=1 in the TIMx_DIER register.</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            
          </field>
          <field>
            <name>CC5IF</name>
            <description>Compare 5 interrupt flag
Refer to CC1IF description (Note: Channel 5 can only be configured as output)</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            
          </field>
          <field>
            <name>CC6IF</name>
            <description>Compare 6 interrupt flag
Refer to CC1IF description (Note: Channel 6 can only be configured as output)</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            
          </field>
          </fields>
        </register>
        <register>
          <name>TIM1_EGR</name>
          <displayName>TIM1_EGR</displayName>
          <description>event generation register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
		  <field>
            <name>UG</name>
            <description>Update generation
This bit can be set by software, it is automatically cleared by hardware.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>No action</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>Reinitialize the counter and generates an update of the registers. The prescaler internal counter is also cleared (the prescaler ratio is not affected). The counter is cleared if the center-aligned mode is selected or if DIR=0 (upcounting), else it takes the auto-reload value (TIMx_ARR) if DIR=1 (downcounting).</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>CC1G</name>
            <description>Capture/Compare 1 generation
This bit is set by software in order to generate an event, it is automatically cleared by hardware.
If channel CC1 is configured as output:
CC1IF flag is set, Corresponding interrupt or DMA request is sent if enabled.
If channel CC1 is configured as input:
The current value of the counter is captured in TIMx_CCR1 register. The CC1IF flag is set, the corresponding interrupt or DMA request is sent if enabled. The CC1OF flag is set if the CC1IF flag was already high.</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>No action</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>A capture/compare event is generated on channel 1:</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>CC2G</name>
            <description>Capture/Compare 2 generation
Refer to CC1G description</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>CC3G</name>
            <description>Capture/Compare 3 generation
Refer to CC1G description</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>CC4G</name>
            <description>Capture/Compare 4 generation
Refer to CC1G description</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
          </field>
          <field>
            <name>COMG</name>
            <description>Capture/Compare control update generation
This bit can be set by software, it is automatically cleared by hardware
Note: This bit acts only on channels having a complementary output.</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>No action</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>When CCPC bit is set, it allows CCxE, CCxNE and OCxM bits to be updated.</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>TG</name>
            <description>Trigger generation
This bit is set by software in order to generate an event, it is automatically cleared by hardware.</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>No action</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>The TIF flag is set in TIMx_SR register. Related interrupt or DMA transfer can occur if enabled.</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>BG</name>
            <description>Break generation
This bit is set by software in order to generate an event, it is automatically cleared by hardware.</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>No action</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>A break event is generated. MOE bit is cleared and BIF flag is set. Related interrupt or DMA transfer can occur if enabled.</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>B2G</name>
            <description>Break 2 generation
This bit is set by software in order to generate an event, it is automatically cleared by hardware.</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>write-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>No action</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>A break 2 event is generated. MOE bit is cleared and B2IF flag is set. Related interrupt can occur if enabled.</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          </fields>
        </register>
