bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G0B0.svd
        <register>
          <name>CR2</name>
          <displayName>CR2</displayName>
          <description>Control register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
		   <field>
            <name>SLVEN</name>
            <description>Synchronous Slave mode enable
When the SLVEN bit is set, the synchronous slave mode is enabled.
Note: When SPI slave mode is not supported, this bit is reserved and must be kept at reset value. Refer to .</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>Slave mode disabled.</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>Slave mode enabled.</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>DIS_NSS</name>
            <description>When the DIS_NSS bit is set, the NSS pin input is ignored.
Note: When SPI slave mode is not supported, this bit is reserved and must be kept at reset value. Refer to .</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>SPI slave selection depends on NSS input pin.</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>SPI slave is always selected and NSS input pin is ignored.</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>ADDM7</name>
            <description>7-bit Address Detection/4-bit Address Detection
This bit is for selection between 4-bit address detection or 7-bit address detection.
This bit can only be written when the USART is disabled (UEÂ =Â 0)
Note: In 7-bit and 9-bit data modes, the address detection is done on 6-bit and 8-bit address (ADD[5:0] and ADD[7:0]) respectively.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>4-bit address detection</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>7-bit address detection (in 8-bit data mode)</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>LBDL</name>
            <description>LIN break detection length
This bit is for selection between 11 bit or 10 bit break detection.
This bit can only be written when the USART is disabled (UEÂ =Â 0).
Note: If LIN mode is not supported, this bit is reserved and must be kept at reset value. Refer to .</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>10-bit break detection</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>11-bit break detection</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>LBDIE</name>
            <description>LIN break detection interrupt enable
Break interrupt mask (break detection using break delimiter).
Note: If LIN mode is not supported, this bit is reserved and must be kept at reset value. Refer to .</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>Interrupt is inhibited</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>An interrupt is generated whenever LBDF = 1 in the USART_ISR register  </description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>LBCL</name>
            <description>Last bit clock pulse
This bit is used to select whether the clock pulse associated with the last data bit transmitted (MSB) has to be output on the SCLK pin in synchronous mode.
The last bit is the 7th or 8th or 9th data bit transmitted depending on the 7 or 8 or 9 bit format selected by the M bit in the USART_CR1 register.
This bit can only be written when the USART is disabled (UEÂ =Â 0).
Note: If synchronous mode is not supported, this bit is reserved and must be kept at reset value. Refer to .</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>The clock pulse of the last data bit is not output to the SCLK pin</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>The clock pulse of the last data bit is output to the SCLK pin</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>CPHA</name>
            <description>Clock phase
This bit is used to select the phase of the clock output on the SCLK pin in synchronous mode. It works in conjunction with the CPOL bit to produce the desired clock/data relationship (see  and )
This bit can only be written when the USART is disabled (UEÂ =Â 0).
Note: If synchronous mode is not supported, this bit is reserved and must be kept at reset value. Refer to .</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>The first clock transition is the first data capture edge</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>The second clock transition is the first data capture edge</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>CPOL</name>
            <description>Clock polarity
This bit enables the user to select the polarity of the clock output on the SCLK pin in synchronous mode. It works in conjunction with the CPHA bit to produce the desired clock/data relationship
This bit can only be written when the USART is disabled (UEÂ =Â 0).
Note: If synchronous mode is not supported, this bit is reserved and must be kept at reset value. Refer to .</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>Steady low value on SCLK pin outside transmission window</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>Steady high value on SCLK pin outside transmission window</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>CLKEN</name>
            <description>Clock enable
This bit enables the user to enable the SCLK pin.
This bit can only be written when the USART is disabled (UEÂ =Â 0).
Note: If neither synchronous mode nor Smartcard mode is supported, this bit is reserved and must be kept at reset value. Refer to .
In Smartcard mode, in order to provide correctly the SCLK clock to the smartcard, the steps below must be respected:
UE = 0
SCEN = 1
GTPR configuration
CLKEN= 1
UE = 1</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>SCLK pin disabled</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>SCLK pin enabled</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>STOP</name>
            <description>stop bits
These bits are used for programming the stop bits.
This bitfield can only be written when the USART is disabled (UEÂ =Â 0).</description>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>1 stop bit</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>0.5 stop bit.</description>
                <value>0x1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x2</name>
                <description>2 stop bits</description>
                <value>0x2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x3</name>
                <description>1.5 stop bits</description>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>LINEN</name>
            <description>LIN mode enable
This bit is set and cleared by software.
The LIN mode enables the capability to send LIN synchronous breaks (13 low bits) using the SBKRQ bit in the USART_CR1 register, and to detect LIN Sync breaks.
This bitfield can only be written when the USART is disabled (UEÂ =Â 0).
Note: If the USART does not support LIN mode, this bit is reserved and must be kept at reset value. Refer to .</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>LIN mode disabled</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>LIN mode enabled</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>SWAP</name>
            <description>Swap TX/RX pins
This bit is set and cleared by software.
This bitfield can only be written when the USART is disabled (UEÂ =Â 0).</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>TX/RX pins are used as defined in standard pinout</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>The TX and RX pins functions are swapped. This enables to work in the case of a cross-wired connection to another UART. </description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>RXINV</name>
            <description>RX pin active level inversion
This bit is set and cleared by software.
This enables the use of an external inverter on the RX line.
This bitfield can only be written when the USART is disabled (UEÂ =Â 0).</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>RX pin signal works using the standard logic levels (VDD =1/idle, Gnd = 0/mark)   </description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>RX pin signal values are inverted (VDD =0/mark, Gnd = 1/idle).   </description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>TXINV</name>
            <description>TX pin active level inversion
This bit is set and cleared by software.
This enables the use of an external inverter on the TX line.
This bitfield can only be written when the USART is disabled (UEÂ =Â 0).</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>TX pin signal works using the standard logic levels (VDD =1/idle, Gnd = 0/mark)   </description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>TX pin signal values are inverted (VDD =0/mark, Gnd = 1/idle).   </description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>DATAINV</name>
            <description>Binary data inversion
This bit is set and cleared by software.
This bitfield can only be written when the USART is disabled (UEÂ =Â 0).</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>Logical data from the data register are send/received in positive/direct logic. (1 = H, 0 = L)     </description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>Logical data from the data register are send/received in negative/inverse logic. (1 = L, 0 = H).     The parity bit is also inverted.</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>MSBFIRST</name>
            <description>Most significant bit first
This bit is set and cleared by software.
This bitfield can only be written when the USART is disabled (UEÂ =Â 0).</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>data is transmitted/received with data bit 0 first, following the start bit. </description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>data is transmitted/received with the MSB (bit 7/8) first, following the start bit. </description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>ABREN</name>
            <description>Auto baud rate enable
This bit is set and cleared by software.
Note: If the USART does not support the auto baud rate feature, this bit is reserved and must be kept at reset value. Refer to .</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>Auto baud rate detection is disabled. </description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>Auto baud rate detection is enabled. </description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>ABRMOD</name>
            <description>Auto baud rate mode
These bits are set and cleared by software.
This bitfield can only be written when ABREN = 0 or the USART is disabled (UEÂ =Â 0).
Note: If DATAINVÂ =Â 1 and/or MSBFIRSTÂ =Â 1 the patterns must be the same on the line, for example 0xAA for MSBFIRST)
If the USART does not support the auto baud rate feature, this bit is reserved and must be kept at reset value. Refer to .</description>
            <bitOffset>21</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>Measurement of the start bit is used to detect the baud rate. </description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>Falling edge to falling edge measurement (the received frame must start with a single bit = 1 and Frame = Start10xxxxxx)</description>
                <value>0x1</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x2</name>
                <description>0x7F frame detection.</description>
                <value>0x2</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x3</name>
                <description>0x55 frame detection</description>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>RTOEN</name>
            <description>Receiver timeout enable
This bit is set and cleared by software.
When this feature is enabled, the RTOF flag in the USART_ISR register is set if the RX line is idle (no reception) for the duration programmed in the RTOR (receiver timeout register).
Note: If the USART does not support the Receiver timeout feature, this bit is reserved and must be kept at reset value. Refer to .</description>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>Receiver timeout feature disabled. </description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>Receiver timeout feature enabled. </description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>ADD</name>
            <description>Address of the USART node
ADD[7:4]:
These bits give the address of the USART node or a character code to be recognized.
They are used to wake up the MCU with 7-bit address mark detection in multiprocessor communication during Mute mode or low-power mode. The MSB of the character sent by the transmitter should be equal to 1. They can also be used for character detection during normal reception, Mute mode inactive (for example, end of block detection in ModBus protocol). In this case, the whole received character (8-bit) is compared to the ADD[7:0] value and CMF flag is set on match.
These bits can only be written when reception is disabled (RE = 0) or the USART is disabled (UEÂ =Â 0).
ADD[3:0]:
These bits give the address of the USART node or a character code to be recognized.
They are used for wakeup with address mark detection, in multiprocessor communication during Mute mode or low-power mode.
These bits can only be written when reception is disabled (RE = 0) or the USART is disabled (UEÂ =Â 0).</description>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
            <access>read-write</access>
          </field>
          </fields>
        </register>
